app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"  WHERE (user_id = '1')
---
  def index
    @reports = Report.all

INSERT INTO "reports" ("created_at", "path", "report_name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-28 15:47:20.206415"], ["path", "public/uploads/1432828040.pdf"], ["report_name", "Report 4"], ["updated_at", "2015-05-28 15:47:20.206415"], ["user_id", 1]]
---
  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save

UPDATE "reports" SET "report_name" = $1, "updated_at" = $2 WHERE "reports"."id" = 1  [["report_name", "Report 1"], ["updated_at", "2015-05-28 15:17:59.668652"]]
---
  def update
    respond_to do |format|
      if @report.update(report_params)

DELETE FROM "reports" WHERE "reports"."id" = $1  [["id", 6]]
---
  def destroy
    @report.destroy

SELECT  "reports".* FROM "reports"  WHERE "reports"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_report
      @report = Report.find(params[:id])