app/controllers/users_controller.rb

INSERT INTO "users" ("address", "created_at", "email", "is_admin", "password", "phone", "timestamps", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "address" = $1, "email" = $2, "is_admin" = $3, "password" = $4, "phone" = $5, "updated_at" = $6, "username" = $7 WHERE "users"."id" = 1  [["address", "TMA"], ["email", "npdat@tma.com.vn"], ["is_admin", "true"], ["password", "123456"], ["phone", "01663942999"], ["updated_at", "2015-05-27 09:45:27.761546"], ["username", "phatdat"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)