app/controllers/user_sessions_controller.rb

  def create
    user = User.find_by(username: params[:username_or_email])
    if user.nil?
      user = User.find_by(email: params[:username_or_email])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'phatdat' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."email" = '007' LIMIT 1